In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":["rohan","seema","mahesh","shruti"],
    "marks":[9,55,67,98],
    "city":["Delhi","Jaipur","Rampur","Barilly"]
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

     name  marks     city
0   rohan      9    Delhi
1   seema     55   Jaipur
2  mahesh     67   Rampur
3  shruti     98  Barilly

In [5]:
df.index=[1,2,3,4]

In [6]:
df

     name  marks     city
1   rohan      9    Delhi
2   seema     55   Jaipur
3  mahesh     67   Rampur
4  shruti     98  Barilly

In [7]:
ser=pd.Series(np.random.rand(20))

In [8]:
ser

0     0.003781
1     0.543555
2     0.039803
3     0.845933
4     0.082695
5     0.200296
6     0.211000
7     0.076000
8     0.055514
9     0.688790
10    0.051573
11    0.401048
12    0.830303
13    0.825660
14    0.199858
15    0.130095
16    0.234681
17    0.554696
18    0.846320
19    0.018468
dtype: float64

In [9]:
type(ser)

pandas.Series

In [10]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [11]:
newdf

            0         1         2         3         4
0    0.412988  0.906870  0.897000  0.757785  0.388182
1    0.774811  0.689734  0.182827  0.564075  0.025209
2    0.863727  0.523040  0.740829  0.628109  0.069564
3    0.548053  0.428264  0.919835  0.644091  0.325021
4    0.220614  0.114261  0.073482  0.638611  0.721985
..        ...       ...       ...       ...       ...
329  0.671114  0.531234  0.752178  0.443387  0.998269
330  0.445032  0.895630  0.223233  0.690822  0.845565
331  0.780849  0.510552  0.344589  0.514186  0.607126
332  0.100191  0.243709  0.165759  0.431054  0.723973
333  0.140064  0.677259  0.407274  0.384079  0.381437

[334 rows x 5 columns]

In [12]:
newdf.head(3)

          0         1         2         3         4
0  0.412988  0.906870  0.897000  0.757785  0.388182
1  0.774811  0.689734  0.182827  0.564075  0.025209
2  0.863727  0.523040  0.740829  0.628109  0.069564

In [13]:
newdf.tail(3)

            0         1         2         3         4
331  0.780849  0.510552  0.344589  0.514186  0.607126
332  0.100191  0.243709  0.165759  0.431054  0.723973
333  0.140064  0.677259  0.407274  0.384079  0.381437

In [14]:
newdf.sort_index(axis=0)

            0         1         2         3         4
0    0.412988  0.906870  0.897000  0.757785  0.388182
1    0.774811  0.689734  0.182827  0.564075  0.025209
2    0.863727  0.523040  0.740829  0.628109  0.069564
3    0.548053  0.428264  0.919835  0.644091  0.325021
4    0.220614  0.114261  0.073482  0.638611  0.721985
..        ...       ...       ...       ...       ...
329  0.671114  0.531234  0.752178  0.443387  0.998269
330  0.445032  0.895630  0.223233  0.690822  0.845565
331  0.780849  0.510552  0.344589  0.514186  0.607126
332  0.100191  0.243709  0.165759  0.431054  0.723973
333  0.140064  0.677259  0.407274  0.384079  0.381437

[334 rows x 5 columns]

In [15]:
newdf.head(3)

          0         1         2         3         4
0  0.412988  0.906870  0.897000  0.757785  0.388182
1  0.774811  0.689734  0.182827  0.564075  0.025209
2  0.863727  0.523040  0.740829  0.628109  0.069564

In [16]:
newdf.tail(3)

            0         1         2         3         4
331  0.780849  0.510552  0.344589  0.514186  0.607126
332  0.100191  0.243709  0.165759  0.431054  0.723973
333  0.140064  0.677259  0.407274  0.384079  0.381437

In [18]:
newdf.sort_index(axis=0)

            0         1         2         3         4
0    0.412988  0.906870  0.897000  0.757785  0.388182
1    0.774811  0.689734  0.182827  0.564075  0.025209
2    0.863727  0.523040  0.740829  0.628109  0.069564
3    0.548053  0.428264  0.919835  0.644091  0.325021
4    0.220614  0.114261  0.073482  0.638611  0.721985
..        ...       ...       ...       ...       ...
329  0.671114  0.531234  0.752178  0.443387  0.998269
330  0.445032  0.895630  0.223233  0.690822  0.845565
331  0.780849  0.510552  0.344589  0.514186  0.607126
332  0.100191  0.243709  0.165759  0.431054  0.723973
333  0.140064  0.677259  0.407274  0.384079  0.381437

[334 rows x 5 columns]

In [20]:
newdf.drop(0,axis=1)

            1         2         3         4
0    0.906870  0.897000  0.757785  0.388182
1    0.689734  0.182827  0.564075  0.025209
2    0.523040  0.740829  0.628109  0.069564
3    0.428264  0.919835  0.644091  0.325021
4    0.114261  0.073482  0.638611  0.721985
..        ...       ...       ...       ...
329  0.531234  0.752178  0.443387  0.998269
330  0.895630  0.223233  0.690822  0.845565
331  0.510552  0.344589  0.514186  0.607126
332  0.243709  0.165759  0.431054  0.723973
333  0.677259  0.407274  0.384079  0.381437

[334 rows x 4 columns]

In [ ]:
newdf.dropna(inplace=True)